# ThemeChanged Event

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIControlledApplication..::..ThemeChanged Event
UIControlledApplication Class See Also
---
Subscribe to the ThemeChanged event to be notified after the theme was changed.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public event EventHandler<ThemeChangedEventArgs> ThemeChanged
```

Visual Basic
---
```text
Public Event ThemeChanged As EventHandler(Of ThemeChangedEventArgs)
```

Visual C++
---
```text
public:
 event EventHandler<ThemeChangedEventArgs^>^ ThemeChanged {
	void add (EventHandler<ThemeChangedEventArgs^>^ value);
	void remove (EventHandler<ThemeChangedEventArgs^>^ value);
}
```

# Remarks
This event is raised after the theme was changed.
# See Also
UIControlledApplication Class
Autodesk.Revit.UI Namespace